//Изминение
&НаКлиенте
Процедура Подклчюиться(Команда)
	
	ОтправитьЗапросНаСайт()
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапросНаСайт()
	
	Ответ = ВыполнитьHTTPЗапрос(АдресСайта+"/SocialPrograms/ActivePrograms");
	
 	КодОтвета = Ответ.Код;
	РезультатОтветаСайта.УстановитьТекст(Ответ.Текст);    
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхПоДоговарам(Команда)
	
	
	МассивКодовПоставщиков = Новый Массив;
	МассивКодовПоставщиков.Добавить(Новый Структура("ID,Code", "123546", "FE-4564"));
	
	ЭлементПредложения = Новый Структура;
	ЭлементПредложения.Вставить("Code", "ПР56454");
	ЭлементПредложения.Вставить("Name", "Офигительный препарат");
	ЭлементПредложения.Вставить("Producer", "Самый лучший");
	ЭлементПредложения.Вставить("VAT", 6);
	ЭлементПредложения.Вставить("SupplierCodes", МассивКодовПоставщиков);
	
	МассивПредложений = Новый Массив;
	МассивПредложений.Добавить(ЭлементПредложения);  
	
	Поставщик = Новый Структура;
	Поставщик.Вставить("ID","123546");
	Поставщик.Вставить("Name","Таблетки");
	Поставщик.Вставить("Edrpo","1235467891011");
	
	МассивПоставщиков = Новый Массив;
	МассивПоставщиков.Добавить(Поставщик);
	
	КорневаяСтруктура = Новый Структура;
	КорневаяСтруктура.Вставить("Offers", МассивПредложений);
	КорневаяСтруктура.Вставить("Suppliers", МассивПоставщиков);
	
	Ответ = ВыполнитьHTTPЗапрос(АдресСайта+"/Import/Ref/51374", ЗаписатьМассивВJSON(КорневаяСтруктура));
	
 	КодОтвета = Ответ.Код;
	РезультатОтветаСайта.УстановитьТекст(Ответ.Текст);    
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхПоЦенам(Команда)
	
	Код = Новый Массив;
	Код.Добавить(Новый Структура("Code","123456"));
	
	Программи = Новый Массив;
	Программи.Добавить(Новый Структура("Id_SocialProgram","3fa85f64-5717-4562-b3fc-2c963f66afa6"));
	
	Цена = Новый Структура;
	Цена.Вставить("Code", "123456");
	Цена.Вставить("Price", 0);
	
	ЦеныНаТовар = Новый Массив;
	ЦеныНаТовар.Добавить(Цена);
	
	Ответ = ВыполнитьHTTPЗапрос(АдресСайта+"/SocialPrograms/Prices", ЗаписатьМассивВJSON(Код));
	
 	КодОтвета = Ответ.Код;
	РезультатОтветаСайта.УстановитьТекст(Ответ.Текст);
	
КонецПроцедуры

Процедура ЗагрузкаДанныхПоОстаткам(Команда)
	
	СпЦены = Новый Массив;
	СпЦены.Добавить(Новый Структура("Id_SocialProgram,Price", "3fa85f64-5717-4562-b3fc-2c963f66afa6", 0));
	
	ЭлементыОтдыха = Новый Структура;
	ЭлементыОтдыха.Вставить("Code", "123456");
	ЭлементыОтдыха.Вставить("Price", 0);
	ЭлементыОтдыха.Вставить("Qty", 0);
	ЭлементыОтдыха.Вставить("PriceReserve", 0);
	ЭлементыОтдыха.Вставить("SpPrices", СпЦены);
	
	МассивОтдыха = Новый Массив;
	МассивОтдыха.Добавить(ЭлементыОтдыха);
	
	Остатки = Новый Массив;
	Остатки.Добавить(Новый Структура("Code,Rests", "123456" , МассивОтдыха));
	
	ДопОпора = Новый Структура;
	ДопОпора.Вставить("additionalProp1", "123456");
	ДопОпора.Вставить("additionalProp2", "123456");
	ДопОпора.Вставить("additionalProp3", "123456");
	
	ДатаВремя = Новый Массив;
	ДатаВремя.Добавить(Новый Структура("DateTime","1030"));
	
	ДопИнфо = Новый Массив;
	ДопИнфо.Добавить(ДопОпора);
	
	Ответ = ВыполнитьHTTPЗапрос(АдресСайта+"/Import/Rests/51374", ЗаписатьМассивВJSON(Остатки));
	
 	КодОтвета = Ответ.Код;
	РезультатОтветаСайта.УстановитьТекст(Ответ.Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ТТНДляЗаказа(Команда)
	
	ТТН = Новый Структура;
	ТТН.Вставить("id", "3fa85f64-5717-4562-b3fc-2c963f66afa6");
	ТТН.Вставить("ttn", "123456");
	ТТН.Вставить("deliveryServiceAlias", "123456");
	
	МассивТТН = Новый Массив;
	МассивТТН.Добавить();
	
	Ответ = ВыполнитьHTTPЗапрос(АдресСайта+"/api/TestOrders/ttnForOrder", ЗаписатьМассивВJSON(МассивТТН));
	
 	КодОтвета = Ответ.Код;
	РезультатОтветаСайта.УстановитьТекст(Ответ.Текст);
	
КонецПроцедуры


Функция ВыполнитьHTTPЗапрос(ПолныйАдресРесурса, СтрокаТела = "") Экспорт
	
	СутркутураОтвета = Новый Структура("Код,Текст" , 0, "");
	
	СтруктураURI = СтруктураURI(ПолныйАдресРесурса); 
	
	Если СтруктураURI.Схема = "https" Тогда 
		ssl1 = Новый ЗащищенноеСоединениеOpenSSL(, Новый СертификатыУдостоверяющихЦентровWindows());
	Иначе 
		ssl1 = Неопределено;
	КонецЕсли;
	
	СтрокаBase64 =  ПолучитьBase64СтрокуИзДвоичныхДанных(ПолучитьДвоичныеДанныеИзСтроки("\test387\admin:E7FF"));
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ПС, "");
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ВК, "");

	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Connection"		, "keep-alive");
	ЗаголовокHTTP.Вставить("Content-type"	, "application/json");
	ЗаголовокHTTP.Вставить("Authorization", "Basic " + СтрокаBase64);

	HTTPСоединение = Новый HTTPСоединение(СтруктураURI.Хост, СтруктураURI.Порт, , , , , ssl1);
	HTTPЗапрос = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере, ЗаголовокHTTP); 
	Если ЗначениеЗаполнено(СтрокаТела) Тогда 
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаТела, КодировкаТекста.UTF8);
	КонецЕсли;
	
	Попытка   
		Если ПустаяСтрока(СтрокаТела) Тогда
			Если СтруктураURI.Удалять Тогда 
				Результат = HTTPСоединение.Удалить(HTTPЗапрос);
			Иначе 
				Результат = HTTPСоединение.Получить(HTTPЗапрос);
			КонецЕсли;
		ИначеЕсли СтруктураURI.ПутьНаСервере = "product-update-qtysadd"  Тогда 
			Результат = HTTPСоединение.Записать(HTTPЗапрос);                                       
		Иначе 
			Результат = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		КонецЕсли;
	Исключение     
		// исключение здесь говорит о том, что запрос не дошел до HTTP-Сервера  
		ТекстОшибки = ОписаниеОшибки();
		Сообщить("Произошла сетевая ошибка!"); 
		Ответ = ТекстОшибки;
		ВызватьИсключение;
	КонецПопытки;
	СутркутураОтвета.Код = Результат.КодСостояния;
	Если Результат.КодСостояния >= 400 и Результат.КодСостояния < 500  Тогда
		СутркутураОтвета.Текст = Результат.ПолучитьТелоКакСтроку();
		Возврат СутркутураОтвета;
	КонецЕсли;
	Если Результат.КодСостояния >= 300 и Результат.КодСостояния < 400  Тогда
 		Если Результат.КодСостояния = 302 Тогда
			СутркутураОтвета.Текст = "Постоянное перенаправление.";
			АдресРесурса = Результат.Заголовки.Получить("Location");
			Если АдресРесурса <> Неопределено  Тогда
				СутркутураОтвета.Текст = ВыполнитьHTTPЗапрос(АдресРесурса);
			Иначе                  
				СутркутураОтвета.Текст = СутркутураОтвета.Текст + Символы.ПС + "Сервер не сообщил адрес ресурса!";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Статусы 1XX и 2XX считаем хорошими     
	Если Результат.КодСостояния < 300 Тогда
 		СутркутураОтвета.Текст = Результат.ПолучитьТелоКакСтроку();
	КонецЕсли;                   
	
	Возврат СутркутураОтвета;
	
Конецфункции  

Функция СтруктураURI(Знач СтрокаURI)
	
	СтрокаURI = СокрЛП(СтрокаURI);
	// схема  
	Схема = "";
	Позиция = Найти(СтрокаURI, "://");
	Если Позиция >0 Тогда
		Схема = НРег(Лев(СтрокаURI, Позиция - 1));
		СтрокаURI = Сред(СтрокаURI, Позиция + 3);
	КонецЕсли;
	// строка соединения и путь на сервере
	СтрокаСоединения = СтрокаURI;
	ПутьНаСервере = "";
	Позиция = Найти(СтрокаСоединения, "/");
	Если Позиция >0 Тогда
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
	КонецЕсли;
	//  информация   пользователя  и имя сервера  
	СтрокаАвторизации = "";
	ИмяСервера = СтрокаСоединения;
	Позиция = Найти(СтрокаСоединения, "@");
	Если Позиция >0 Тогда
		СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
		ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
	КонецЕсли;
	// логин и пароль  
	Логин = СтрокаАвторизации;
	Пароль = "";
	Позиция = Найти(СтрокаАвторизации, ":");
	Если Позиция >0 Тогда
		Логин = Лев(СтрокаАвторизации, Позиция - 1);
		Пароль = Сред(СтрокаАвторизации, Позиция + 1);
	КонецЕсли;
	// хост и порт  
	Хост = ИмяСервера;
	Порт = "";
	Позиция = Найти(ИмяСервера, ":");
	Если Позиция >0 Тогда
		Хост = Лев(ИмяСервера, Позиция - 1);
		Порт = Сред(ИмяСервера, Позиция + 1);
	КонецЕсли;
	Удалять = Найти(СтрокаURI, "delete") <> 0;
	Результат = Новый Структура;
	Результат.Вставить("Удалять", Удалять);
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	Результат.Вставить("ИмяСервера", ИмяСервера);
	Результат.Вставить("Хост", Хост);
	Результат.Вставить("Порт", ?(Порт <> "", Число(Порт), Неопределено));
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьМассивВJSON(МассивСтруктура, Отказ = Ложь, ТекстОшибки = "") Экспорт
	
	Результат = "";
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивСтруктура);   
	Результат = ЗаписьJSON.Закрыть();           
	
	Возврат Результат;

КонецФункции

Функция ПрочитатьМассивИзJSON(СтрокаМассивСтруктура, Отказ = Ложь, ТекстОшибки = "") Экспорт
	
	Результат = Неопределено;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаМассивСтруктура);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ГотовКОтправке(Команда)
	
	ДопИнфо = Новый Структура;
	ДопИнфо.Вставить("additionalProp1","123546");
	ДопИнфо.Вставить("additionalProp2","Таблетки");
	ДопИнфо.Вставить("additionalProp3","1235467891011");
	
	МассивДопИнфо = Новый Массив;
	МассивДопИнфо.Добавить(ДопИнфо);
	
	Ряды = Новый Структура;
	Ряды.Вставить("goodsCode","123546");
	Ряды.Вставить("goodsName","Таблетки");
	Ряды.Вставить("goodsProducer","1235467891011");
	Ряды.Вставить("qty", 0);
	Ряды.Вставить("price", 0);
	Ряды.Вставить("qtyShip", 0);
	Ряды.Вставить("priceShip", 0);
	Ряды.Вставить("needOrder", 0);
	Ряды.Вставить("additionalInfo", ДопИнфо);
	
	МассивРядов = Новый Массив;
	МассивРядов.Добавить(Ряды);
	
	ЭлементГотовКОтправке = Новый Структура;
	ЭлементГотовКОтправке.Вставить("id", "3fa85f64-5717-4562-b3fc-2c963f66afa6");
	ЭлементГотовКОтправке.Вставить("branchID", "string");
	ЭлементГотовКОтправке.Вставить("externalNmb", "string");
	ЭлементГотовКОтправке.Вставить("docAdditionalInfo", "string");
	ЭлементГотовКОтправке.Вставить("customerAdditionalInfo","string");
	ЭлементГотовКОтправке.Вставить("weight", 0);
	ЭлементГотовКОтправке.Вставить("weight", 0);
	ЭлементГотовКОтправке.Вставить("length", 0);
	ЭлементГотовКОтправке.Вставить("width", 0);
	ЭлементГотовКОтправке.Вставить("rows", МассивРядов);
	
	ГотовКОтправке = Новый Массив;
	ГотовКОтправке.Добавить(ЭлементГотовКОтправке);
	
	Ответ = ВыполнитьHTTPЗапрос(АдресСайта+"/api/TestOrders/readyToDelivery", ЗаписатьМассивВJSON(ГотовКОтправке));
	
 	КодОтвета = Ответ.Код;
	РезультатОтветаСайта.УстановитьТекст(Ответ.Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестовыеЗаказы(Команда)
	
	ДопИнфо = Новый Структура;
	ДопИнфо.Вставить("additionalProp1","string");
	ДопИнфо.Вставить("additionalProp2","string");
	ДопИнфо.Вставить("additionalProp3","string");
	
	МассивДопИнфо = Новый Массив;
	МассивДопИнфо.Добавить(ДопИнфо);
	
	//изминение
	
	Ряды = Новый Структура;
	Ряды.Вставить("goodsCode", "string");
	Ряды.Вставить("goodsName", "string");
	Ряды.Вставить("goodsProducer", "string");
	Ряды.Вставить("qty", 0);
	Ряды.Вставить("price", 0);
	Ряды.Вставить("qtyShip", 0);
	Ряды.Вставить("priceShip", 0);
	Ряды.Вставить("needOrder", 0);
	Ряды.Вставить("additionalInfo", МассивДопИнфо);
	
	МассивРядов = Новый Массив;
	МассивРядов.Добавить(Ряды);
	
	ЭлементТестовыхЗаказов = Новый Структура;
	ЭлементТестовыхЗаказов.Вставить("id", "3fa85f64-5717-4562-b3fc-2c963f66afa6");
	ЭлементТестовыхЗаказов.Вставить("code", 0);
	ЭлементТестовыхЗаказов.Вставить("statusID", 0);
	ЭлементТестовыхЗаказов.Вставить("dateTimeCreated", "2023-06-06T15:26:52.581Z");
	ЭлементТестовыхЗаказов.Вставить("customer","string");
	ЭлементТестовыхЗаказов.Вставить("customerPhone", "string");
	ЭлементТестовыхЗаказов.Вставить("customerEmail", "string");
	ЭлементТестовыхЗаказов.Вставить("comment", "string");
	ЭлементТестовыхЗаказов.Вставить("branchID", "string");
	ЭлементТестовыхЗаказов.Вставить("externalNmb", "string");
	ЭлементТестовыхЗаказов.Вставить("docAdditionalInfo", "string");
	ЭлементТестовыхЗаказов.Вставить("customerAdditionalInfo", "string");
	ЭлементТестовыхЗаказов.Вставить("reserveSource", "string");
	ЭлементТестовыхЗаказов.Вставить("cancelReason", "string");
	ЭлементТестовыхЗаказов.Вставить("rows", МассивРядов);
	
	ИнфоДоставки = Новый Структура;
	ИнфоДоставки.Вставить("key","string");
	ИнфоДоставки.Вставить("value","string");
	ИнфоДоставки.Вставить("description","string");
	
	МассивИнфоДоставки = Новый Массив;
	МассивИнфоДоставки.Добавить(ИнфоДоставки);
	
	ТестовыйЗаказ = Новый Массив;
	ТестовыйЗаказ.Добавить(ЭлементТестовыхЗаказов);
	
	Ответ = ВыполнитьHTTPЗапрос(АдресСайта+"/api/TestOrders", ЗаписатьМассивВJSON(ТестовыйЗаказ));
	
 	КодОтвета = Ответ.Код;
	РезультатОтветаСайта.УстановитьТекст(Ответ.Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестовыеЗаказыНовое(Команда)
	
	ДопИнфо = Новый Структура;
	ДопИнфо.Вставить("additionalProp1","string");
	ДопИнфо.Вставить("additionalProp2","string");
	ДопИнфо.Вставить("additionalProp3","string");
	
	МассивДопИнфо = Новый Массив;
	МассивДопИнфо.Добавить(ДопИнфо);
	
	Ряды = Новый Структура;
	Ряды.Вставить("goodsCode", "string");
	Ряды.Вставить("goodsName", "string");
	Ряды.Вставить("goodsProducer", "string");
	Ряды.Вставить("qty", 0);
	Ряды.Вставить("price", 0);
	Ряды.Вставить("qtyShip", 0);
	Ряды.Вставить("priceShip", 0);
	Ряды.Вставить("needOrder", 0);
	Ряды.Вставить("additionalInfo", МассивДопИнфо);
	
	МассивРядов = Новый Массив;
	МассивРядов.Добавить(Ряды);
	
	ЭлементНовыхТестовыхЗаказов = Новый Структура;
	ЭлементНовыхТестовыхЗаказов.Вставить("id", "3fa85f64-5717-4562-b3fc-2c963f66afa6");
	ЭлементНовыхТестовыхЗаказов.Вставить("code", 0);
	ЭлементНовыхТестовыхЗаказов.Вставить("statusID", 0);
	ЭлементНовыхТестовыхЗаказов.Вставить("dateTimeCreated", "2023-06-06T15:39:53.698Z");
	ЭлементНовыхТестовыхЗаказов.Вставить("customer","string");
	ЭлементНовыхТестовыхЗаказов.Вставить("customerPhone", "string");
	ЭлементНовыхТестовыхЗаказов.Вставить("customerEmail", "string");
	ЭлементНовыхТестовыхЗаказов.Вставить("comment", "string");
	ЭлементНовыхТестовыхЗаказов.Вставить("branchID", "string");
	ЭлементНовыхТестовыхЗаказов.Вставить("externalNmb", "string");
	ЭлементНовыхТестовыхЗаказов.Вставить("docAdditionalInfo", "string");
	ЭлементНовыхТестовыхЗаказов.Вставить("customerAdditionalInfo", "string");
	ЭлементНовыхТестовыхЗаказов.Вставить("reserveSource", "string");
	ЭлементНовыхТестовыхЗаказов.Вставить("cancelReason", "string");
	ЭлементНовыхТестовыхЗаказов.Вставить("rows", МассивРядов);
	
	ИнфоДоставки = Новый Структура;
	ИнфоДоставки.Вставить("key","string");
	ИнфоДоставки.Вставить("value","string");
	ИнфоДоставки.Вставить("description","string");
	
	МассивИнфоДоставки = Новый Массив;
	МассивИнфоДоставки.Добавить(ИнфоДоставки);
	
	ТестовыйЗаказ = Новый Массив;
	ТестовыйЗаказ.Добавить(ЭлементНовыхТестовыхЗаказов);
	
	Ответ = ВыполнитьHTTPЗапрос(АдресСайта+"/api/TestOrders/New", ЗаписатьМассивВJSON(ТестовыйЗаказ));
	
 	КодОтвета = Ответ.Код;
	РезультатОтветаСайта.УстановитьТекст(Ответ.Текст);
	
КонецПроцедуры






АдресСайта = "https://import.tabletki.ua";